In [1]:
import numpy as np 
import pandas as pd

In [2]:
dict1 = {
    "names":['rumaz','zayyan','rohan','abhiyan','isfahan'],
    "marks":[95,34,45,23,78],
    "city":['karachi','islamabad','egypt','bangladesh','europe']
}

In [3]:
df = pd.DataFrame(dict1)

In [4]:
df.index=[1,2,3,4,5]

In [5]:
df.column=('s.no')

In [6]:
df

     names  marks        city
1    rumaz     95     karachi
2   zayyan     34   islamabad
3    rohan     45       egypt
4  abhiyan     23  bangladesh
5  isfahan     78      europe

In [7]:
df.head()

     names  marks        city
1    rumaz     95     karachi
2   zayyan     34   islamabad
3    rohan     45       egypt
4  abhiyan     23  bangladesh
5  isfahan     78      europe

In [8]:
df.tail()

     names  marks        city
1    rumaz     95     karachi
2   zayyan     34   islamabad
3    rohan     45       egypt
4  abhiyan     23  bangladesh
5  isfahan     78      europe

In [9]:
ser = pd.Series(np.random.rand(12))

In [10]:
ser

0     0.505568
1     0.018536
2     0.893366
3     0.023157
4     0.597578
5     0.935830
6     0.069967
7     0.060821
8     0.180428
9     0.117871
10    0.836325
11    0.763944
dtype: float64

In [11]:
type(ser)

pandas.core.series.Series

In [12]:
newdf = pd.DataFrame(np.random.rand(334,5),index=np.arange(334))

In [13]:
newdf.head()

          0         1         2         3         4
0  0.888263  0.046169  0.591636  0.331264  0.351935
1  0.314070  0.815956  0.595768  0.680282  0.069006
2  0.055771  0.591016  0.518951  0.577949  0.624218
3  0.605822  0.126805  0.707643  0.760552  0.751149
4  0.165166  0.608367  0.022790  0.951450  0.018919

In [14]:
newdf.describe()

                0           1           2           3           4
count  334.000000  334.000000  334.000000  334.000000  334.000000
mean     0.481585    0.474361    0.493144    0.499439    0.504178
std      0.283428    0.284533    0.285510    0.285208    0.285826
min      0.000344    0.000498    0.002355    0.002983    0.007581
25%      0.246733    0.217472    0.242998    0.248512    0.271375
50%      0.452165    0.470172    0.488585    0.491149    0.483454
75%      0.727220    0.709544    0.740915    0.745475    0.754444
max      0.997633    0.998385    0.998448    0.988234    0.998415

In [15]:
newdf.tail()

            0         1         2         3         4
329  0.654374  0.813623  0.719809  0.694710  0.978904
330  0.246068  0.577463  0.421411  0.130040  0.424515
331  0.797803  0.596781  0.427971  0.636051  0.663481
332  0.341646  0.222081  0.730123  0.082885  0.313533
333  0.101376  0.790993  0.478928  0.507336  0.401785

In [16]:
newdf[1][1]

np.float64(0.8159555841499353)

In [17]:
newdf.dtypes

0    float64
1    float64
2    float64
3    float64
4    float64
dtype: object

In [18]:
newdf[0][0]="Rumaz"

<ipython-input-18-19950fd5fa3f>:1: FutureWarning: ChainedAssignmentError: behaviour will change in pandas 3.0!
You are setting values through chained assignment. Currently this works in certain cases, but when using Copy-on-Write (which will become the default behaviour in pandas 3.0) this will never work to update the original DataFrame or Series, because the intermediate object on which we are setting values will behave as a copy.
A typical example is when you are setting values in a column of a DataFrame, like:

df["col"][row_indexer] = value

Use `df.loc[row_indexer, "col"] = values` instead, to perform the assignment in a single step and ensure this keeps updating the original `df`.

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy

  newdf[0][0]="Rumaz"
<ipython-input-18-19950fd5fa3f>:1: FutureWarning: Setting an item of incompatible dtype is deprecated and will raise an error in a future version of pandas. Value 'Rumaz' has dtype incompatible with float64, please explicitly cast to a compatible dtype first.
  newdf[0][0]="Rumaz"

In [19]:
newdf.head()

          0         1         2         3         4
0     Rumaz  0.046169  0.591636  0.331264  0.351935
1   0.31407  0.815956  0.595768  0.680282  0.069006
2  0.055771  0.591016  0.518951  0.577949  0.624218
3  0.605822  0.126805  0.707643  0.760552  0.751149
4  0.165166  0.608367  0.022790  0.951450  0.018919

In [20]:
newdf.loc[[1,3],[0]]

          0
1   0.31407
3  0.605822

In [21]:
newdf.head()

          0         1         2         3         4
0     Rumaz  0.046169  0.591636  0.331264  0.351935
1   0.31407  0.815956  0.595768  0.680282  0.069006
2  0.055771  0.591016  0.518951  0.577949  0.624218
3  0.605822  0.126805  0.707643  0.760552  0.751149
4  0.165166  0.608367  0.022790  0.951450  0.018919

In [22]:
newdf[[1]].isnull()

         1
0    False
1    False
2    False
3    False
4    False
..     ...
329  False
330  False
331  False
332  False
333  False

[334 rows x 1 columns]

In [23]:
newdf.loc[:,[2]]=23

In [24]:
newdf.loc[[2]]=2333

In [25]:
newdf

            0            1       2            3            4
0       Rumaz     0.046169    23.0     0.331264     0.351935
1     0.31407     0.815956    23.0     0.680282     0.069006
2        2333  2333.000000  2333.0  2333.000000  2333.000000
3    0.605822     0.126805    23.0     0.760552     0.751149
4    0.165166     0.608367    23.0     0.951450     0.018919
..        ...          ...     ...          ...          ...
329  0.654374     0.813623    23.0     0.694710     0.978904
330  0.246068     0.577463    23.0     0.130040     0.424515
331  0.797803     0.596781    23.0     0.636051     0.663481
332  0.341646     0.222081    23.0     0.082885     0.313533
333  0.101376     0.790993    23.0     0.507336     0.401785

[334 rows x 5 columns]

In [26]:
newdf[2].isnull()

0      False
1      False
2      False
3      False
4      False
       ...
329    False
330    False
331    False
332    False
333    False
Name: 2, Length: 334, dtype: bool

In [27]:
df = pd.DataFrame(np.random.randint(1,6,size=(3,2)))

In [28]:
df

   0  1
0  2  1
1  5  5
2  3  5

In [29]:
df.describe()

              0         1
count  3.000000  3.000000
mean   3.333333  3.666667
std    1.527525  2.309401
min    2.000000  1.000000
25%    2.500000  3.000000
50%    3.000000  5.000000
75%    4.000000  5.000000
max    5.000000  5.000000

In [30]:
df.mean()

0    3.333333
1    3.666667
dtype: float64

In [31]:
df.median()

0    3.0
1    5.0
dtype: float64

In [32]:
df.corr()

          0         1
0  1.000000  0.755929
1  0.755929  1.000000

In [33]:
df.count()

0    3
1    3
dtype: int64

In [34]:
df

   0  1
0  2  1
1  5  5
2  3  5

In [35]:
df.T

   0  1  2
0  2  5  3
1  1  5  5

In [36]:
df.T

   0  1  2
0  2  5  3
1  1  5  5

In [37]:
df

   0  1
0  2  1
1  5  5
2  3  5

In [38]:
df.count()

0    3
1    3
dtype: int64

In [39]:
df.max()

0    5
1    5
dtype: int32

In [40]:
df.min()

0    2
1    1
dtype: int32

In [41]:
df.std()

0    1.527525
1    2.309401
dtype: float64

In [42]:
df

   0  1
0  2  1
1  5  5
2  3  5